Repository: kenichisutan/canadian-budget-en-fr-sentiment-analysis
Catalog: data/corpora/federal-budget/budget-2025-en-budget-2025-fr.tmx
Source language: en_en
Languages: fr_fr

source: employment barriers annually. $20.1 million of this is offset by funding already
fr_fr: l'emploi. De cette somme, un montant de 20,1 millions de dollars

source: provisioned in the fiscal framework.
fr_fr: proviendra de fonds déjà prévus dans le cadre financier.

source: Budget 2025 proposes to provide $635.2 million over three years,
fr_fr: Le budget de 2025 propose de verser 635,2 millions de dollars

source: starting in 2026-27, to Employment and Social Development Canada for the Student
fr_fr: sur trois ans, à compter de 2026-2027, à Emploi et Développement social Canada pour

source: Work Placement Program to support around 55,000 work-integrated learning opportunities for post-secondary students in 2026-27.
fr_fr: que le Programme de stages pratiques pour étudiants soutienne environ 55 000 occasions d'apprentissage en milieu de travail en 2026-2027 pour les personnes qui font des études postsecondaires.

source: Advancing the Youth Climate Corps
fr_fr: Promouvoir le service jeunesse pour le climat

source: Investing in paid green skills training and job placements positions Canada to be competitive by
fr_fr: En investissant dans des formations et des stages rémunérés visant l'acquisition de compétences

source: equipping the workforce needed to build a climate competitive economy.
fr_fr: besoin pour bâtir une économie concurrentielle à l'épreuve du climat.

source: Budget 2025 proposes to provide $40 million over two years,
fr_fr: Le budget de 2025 propose d'attribuer 40 millions de dollars sur

source: starting in 2026-27, to Employment and Social Development Canada, to create a Youth
fr_fr: deux ans, à compter de 2026-2027, à Emploi et Développement social Canada pour la création

source: Climate Corps to provide paid skills training for young Canadians.
fr_fr: d'un service jeunesse pour le climat qui offrira de la formation professionnelle rémunérée aux

source: They will be trained to
fr_fr: jeunes Canadiens.

source: quickly respond to climate emergencies, support recovery, and strengthen resilience in
fr_fr: urgences climatiques, d'appuyer les mesures de rétablissement et d'accroître la résilience des

source: communities across the country.
fr_fr: communautés partout au pays.

source: The skills training and work experience opportunities
fr_fr: Ces possibilités de formation et d'expérience pratique générées par

source: created through a Youth Climate Corps support reducing youth unemployment, increasing
fr_fr: un service jeunesse pour le climat aideront à réduire le chômage chez les jeunes, à accroître

source: innovation, and strengthening adaptation and mitigation projects.
fr_fr: l'innovation et à renforcer les projets d'adaptation et d'atténuation.

source: 3.3 Protecting Canadian Culture, Values, and Identity
fr_fr: 3.3 Protéger la culture, l'identité et les valeurs canadiennes

source: Canada's values are rooted in our shared identity, cultural richness, and deep connection to the
fr_fr: Les valeurs canadiennes reposent sur notre identité commune, notre richesse culturelle et notre lien

source: land.
fr_fr: Nous avons tant de choses dont nous pouvons être fiers, que nous pouvons

source: We have so much to be proud of, celebrate, and defend as Canadians.
fr_fr: mettre en valeur et que nous pouvons défendre.

source: The government is
fr_fr: Le gouvernement est déterminé à protéger ce qui rend

source: committed to protecting what makes Canada unique and brings Canadians together—through continued
fr_fr: le Canada unique et ce qui unit les Canadiens, par des investissements continus dans nos langues

source: investments in our official languages, our public institutions, and our natural and cultural
fr_fr: officielles, nos institutions publiques et notre patrimoine naturel et culturel.

source: heritage. These measures reflect a clear vision: a strong, united, and resilient Canada, where our way of life
fr_fr: Ces mesures témoignent d'une vision claire : un Canada fort, uni et résilient, où notre mode de

source: is protected, celebrated, and passed on to future generations.
fr_fr: vie est protégé, mis en valeur et transmis aux générations futures.

source: Funding for the Department for Women and Gender Equality
fr_fr: Fournir un nouveau financement au ministère des Femmes et de l'Égalité des genres

source: Since its establishment in 2018, the Department for Women and Gender Equality (WAGE)
fr_fr: Depuis sa création en 2018, le ministère des Femmes et de l'Égalité des genres Canada (FEGC)

source: has empowered women and 2SLGBTQI+ people through programs that enhance meaningful participation in
fr_fr: renforce la capacité des femmes et des personnes 2ELGBTQI+ grâce à des programmes qui favorisent

source: our economy.
fr_fr: leur participation à part entière à notre économie.

source: WAGE's work extends across government, helping departments and agencies include
fr_fr: du gouvernement, aident les ministères et les organismes à faire appel à de plus en plus de

source: more Canadians in shaping and strengthening our country's social and economic fabric.
fr_fr: Canadiens pour qu'ils contribuent à façonner et à renforcer notre structure sociale et économique nationale.

source: Building on the significant progress made by Status of Women Canada to advance gender equality
fr_fr: S'appuyant sur les énormes progrès réalisés de 1976 à 2018 par Condition féminine Canada en

source: from 1976 to 2018, WAGE made historic investments that reduced discrimination and helped
fr_fr: discrimination et aidé les femmes à progresser dans le monde du travail. Ce ministère a aussi

source: women advance in the workplace, worked with partners to launch federal strategies to address
fr_fr: collaboré avec des partenaires au lancement de stratégies fédérales visant à résoudre des enjeux

source: critical issues impacting women, girls, and 2SLGBTQI+ people, and advocated for a future where
fr_fr: FEGC s'emploie à assurer à chaque individu un avenir où il peut se réaliser pleinement.

source: everyone can achieve their full potential.
fr_fr: Cependant, on recense encore des

source: However, incidents of gender-based violence—including
fr_fr: incidents de violence fondée sur le genre, notamment les féminicides, ainsi que des actes haineux et

source: femicides—continue, as does hate and violence targeting 2SLGBTQI+ communities in Canada.
fr_fr: violents qui ciblent les communautés 2ELGBTQI+ au Canada.

source: The work of
fr_fr: Les travaux de FEGC sont nécessaires

source: WAGE is needed to eliminate discrimination and advance the rights of women and 2SLGBTQI+
fr_fr: pour éliminer la discrimination et faire avancer les droits des femmes et des communautés 2ELGBTQI+.

source: communities. As announced on October 29, 2025, to ensure WAGE is able to conduct
fr_fr: Comme il a été annoncé le 29 octobre 2025, pour s'assurer que FEGC est en mesure

source: its critical work and provide long-term benefits, Budget 2025 proposes to provide
fr_fr: de 2025 propose de fournir un nouveau financement à ce ministère, réparti comme suit : Une somme de 382,5 millions de dollars sur cinq ans, à compter de 2026-2027,

source: WAGE with new funding: $382.5 million over five years, starting in 2026-27, with $76.5 million
fr_fr: et de 76,5 millions de dollars par année par la suite, pour revitaliser et stabiliser

source: ongoing, to revitalise and stabilise efforts to advance women's equality in Canada. $54.6 million over five years, starting in 2026-27, with $10.9 million
fr_fr: les mesures qui font progresser l'égalité des femmes au Canada. Une somme de 54,6 millions de dollars sur cinq ans, à compter de 2026-2027,

source: ongoing, to support the 2SLGBTQI+ community sector.
fr_fr: et de 10,9 millions de dollars par année par la suite, pour appuyer la communauté 2ELGBTQI+.

source: This includes $7.5 million
fr_fr: le cadre de festivals de la fierté.

source: over five years, with $1.5 million ongoing, for Pride Security. $223.4 million over five years, starting in 2026-27, with $44.7 million
fr_fr: Une somme de 223,4 millions de dollars sur cinq ans, à compter de 2026-2027, et de 44,7 millions de dollars par année par la suite, pour renforcer les mesures

source: ongoing, to strengthen federal action on gender-based violence.
fr_fr: visant à mettre fin à la violence fondée sur le genre.

source: This new funding will support women's organisations in addressing deeply rooted barriers to women's
fr_fr: Ce nouveau financement aidera les organismes de femmes à éliminer les obstacles persistants à la

source: economic prosperity and success, support the vision of a Canada free of gender-based violence from
fr_fr: prospérité et à la réussite économique des femmes. Il appuiera aussi la vision d'un Canada libre de

source: coast-to-coast-to-coast, and advance 2SLGBTQI+ equality, including keeping 2SLGBTQI+ communities and
fr_fr: violence fondée sur le genre, partout au pays, et favorisera l'égalité pour les membres de la

source: their allies safe.
fr_fr: communauté 2ELGBTQI+, notamment en protégeant les communautés et leurs alliés.

source: Ministers Champagne and Valdez also reaffirmed the government's commitment to continue the important
fr_fr: Les ministres Champagne et Valdez ont aussi réaffirmé l'engagement du gouvernement à poursuivre les

source: ongoing work with the provinces and territories to end gender-based violence—including through the
fr_fr: importants travaux entrepris avec les provinces et les territoires pour mettre fin à la violence

source: current bilateral agreements that enable these jurisdictions to fund essential prevention services
fr_fr: Ces ententes permettent aux provinces et territoires de financer les services essentiels de prévention et

source: and direct support for survivors.
fr_fr: d'orienter le soutien vers les survivants.

source: Empowering Seniors in Their Communities
fr_fr: Accroître l'autonomie des aînés au sein de leurs communautés

source: Far too many of our seniors face isolation in their retirement years, and some experience ageism,
fr_fr: Trop d'aînés doivent faire face à l'isolement tout au long de leur retraite et, dans certains cas, à

source: poor health, reduced mobility, poverty, and even abuse.
fr_fr: l'âgisme, à la maladie, à une mobilité réduite, à la pauvreté et même à diverses formes d'exploitation.

source: Canada's new government is helping to
fr_fr: Le nouveau gouvernement du Canada contribue à la résolution de ces problèmes en

source: address this by empowering seniors to thrive in their communities through the New Horizons
fr_fr: donnant aux personnes âgées les moyens de s'épanouir dans leur communauté grâce au programme

source: for Seniors Program .
fr_fr: Nouveaux Horizons pour les aînés .

source: The New Horizons for Seniors Program , with a current annual budget of
fr_fr: Le programme Nouveaux Horizons pour les aînés, doté d'un budget annuel

source: $70 million, supports projects that improve the quality of life for seniors and promotes their
fr_fr: de 70 millions de dollars, appuie des projets qui améliorent la qualité de vie des

source: full participation in Canadian society.
fr_fr: personnes âgées et encourage leur pleine participation à la société canadienne. Le programme offre

source: The program offers up to $25,000 to support projects in
fr_fr: jusqu'à 25 000 $ pour appuyer des projets dans les communautés locales, comme

source: local communities—such as new fitness equipment for seniors' centres—and up to $5 million to
fr_fr: l'acquisition de nouveaux appareils de conditionnement physique destinés à des centres pour aînés,

source: support projects that are national in scope and that can benefit seniors across the country, like
fr_fr: et jusqu'à 5 millions de dollars pour appuyer des projets de portée nationale pouvant

source: financial literacy classes.
fr_fr: profiter aux aînés de tout le pays, par exemple des cours d'éducation financière.

source: Connecting Canadians Through Cultural Experiences and Community Celebrations
fr_fr: Rapprocher les Canadiens grâce à des expériences culturelles et à des célébrations communautaires

source: Culture is experienced locally, in our towns, neighbourhoods, and public spaces.
fr_fr: La culture se vit à l'échelle locale soit : dans nos villes, nos quartiers et nos espaces

source: These investments
fr_fr: publics.

source: will help bring Canadians together at festivals, national moments of celebration, and
fr_fr: Les investissements à cet égard aideront à rassembler les Canadiens lors des festivals, des

source: community-driven cultural events across the country.
fr_fr: célébrations nationales et des événements culturels communautaires partout au pays. Le budget

source: Budget 2025 proposes to provide targeted
fr_fr: de 2025 propose d'offrir un soutien ciblé pour renforcer la participation et l'identité

source: support to strengthen participation, community identity, and cultural access for Canadians in
fr_fr: communautaire des Canadiens et leur accès à la culture partout au pays.

source: every region, including: $21 million over three years, starting in 2026-27, to Canadian
fr_fr: Un financement de 21 millions de dollars sur trois ans, à compter de 2026-2027,

source: Heritage for the Building Communities through Arts and Heritage Program to
fr_fr: par le biais des arts et du patrimoine afin de soutenir les festivals locaux, les

source: support local festivals, community anniversaries, and community-initiated
fr_fr: commémorations communautaires et les projets d'immobilisations communautaires.

source: capital projects; $46.5 million over three years, starting in 2026-27, to
fr_fr: Un financement de 46,5 millions de dollars sur trois ans, à compter de 2026-2027,

source: Canadian Heritage for the Canada Arts Presentation Fund to support
fr_fr: sera accordé à Patrimoine canadien pour le Fonds du Canada pour la présentation des

source: professionally presented arts festivals or performing arts series;
fr_fr: arts afin d'aider les organismes qui présentent professionnellement des festivals

source: $20 million over four years, starting in 2026-27, to Canadian
fr_fr: Un financement de 20 millions de dollars sur quatre ans, à compter de 2026-2027,

source: Heritage for the Celebration and Commemoration Program to support Canada
fr_fr: sera accordé à Patrimoine canadien pour son Programme des célébrations et des

source: Day celebrations;
fr_fr: commémorations afin de soutenir les célébrations de la fête du Canada.

source: $4 million over four years, starting in 2026-27, to Canadian
fr_fr: Un financement de 4 millions de dollars sur quatre ans, à compter de 2026-2027,

source: Heritage for the Celebration and Commemoration Program to support National
fr_fr: sera accordé à Patrimoine canadien pour son Programme des célébrations et des

source: Acadian Day; and
fr_fr: nationale des Acadiens et des Acadiennes.

source: $9 million over three years, starting in 2026-27, to
fr_fr: Un financement de 9 millions de dollars sur trois ans, à compter de 2026-2027,

source: Environment and Climate Change Canada to support the Biosphère in Montréal.
fr_fr: sera accordé à Environnement et Changement climatique Canada afin la Biosphère à Montréal.

source: Investing in Canadian Creators and the Cultural Economy
fr_fr: Investir dans les créateurs canadiens et l'économie culturelle

source: Canada's artists, creators, and cultural entrepreneurs are at the heart of our creative economy.
fr_fr: Les artistes, les créateurs et les entrepreneurs culturels du Canada sont au cœur de notre économie

source: Their work drives innovation, supports good jobs, and ensures Canadian stories and voices are heard
fr_fr: créative. Leur travail stimule l'innovation et soutient des emplois intéressants.

source: at home and around the world.
fr_fr: Grâce à eux, les

source: Budget 2025 proposes to provide funding to grow Canada's creative
fr_fr: budget de 2025 propose de fournir des fonds pour faire croître les industries créatives du

source: industries and help Canadian talent succeed in an increasingly digital and global marketplace,
fr_fr: Canada et aider les talents canadiens à se démarquer dans un marché de plus en plus numérique et

source: including:
fr_fr: mondialisé, comme suit :

source: $48 million over three years, starting in 2026-27, to Canadian
fr_fr: Une somme de 48 millions de dollars sur trois ans, à compter de 2026-2027, sera

source: Heritage for the Canada Music Fund to enhance the careers of Canadian
fr_fr: accordée à Patrimoine canadien pour le Fonds de la musique du Canada afin de

source: artists while strengthening the competitiveness and stability of the Canadian
fr_fr: faire avancer la carrière des artistes canadiens tout en renforçant la compétitivité et la

source: music sector;
fr_fr: stabilité du secteur canadien de la musique.

source: $6 million over three years, starting in 2026-27, to Canadian
fr_fr: Une somme de 6 millions de dollars sur trois ans, à compter de 2026-2027, sera

source: Heritage to support the purchase of Canadian content for the
fr_fr: accordée à Patrimoine canadien pour la plateforme TV5MONDEplus pour l'achat de contenu

source: TV5MONDEplus platform;
fr_fr: canadien.

source: $150 million over three years, starting in 2026-27, to
fr_fr: Une somme de 150 millions de dollars sur trois ans, à compter de 2026-2027, sera

source: Telefilm Canada to support Canada's vibrant film industry;
fr_fr: accordée à Téléfilm Canada pour soutenir le dynamisme de l'industrie cinématographique canadienne.

source: $127.5 million over three years, starting in 2026-27, to
fr_fr: Une somme de 127,5 millions de dollars sur trois ans, à compter de 2026-2027,

source: Canadian Heritage for the Canada Media Fund to support Canada's
fr_fr: sera accordée à Patrimoine canadien pour le Fonds des médias du Canada afin

source: audio-visual content creators;
fr_fr: d'appuyer les créateurs de contenu audiovisuel canadiens.

source: $26.1 million over three years, starting in 2026-27, to the
fr_fr: Une somme de 26,1 millions de dollars sur trois ans, à compter de 2026-2027, sera

source: National Film Board to produce and share Canadian content with the world;
fr_fr: accordée à l'Office national du film afin qu'il produise du contenu canadien et le diffuse dans le monde entier.

source: $38.4 million over three years, starting in 2026-27, to
fr_fr: Une somme de 38,4 millions de dollars sur trois ans, à compter de 2026-2027, sera

source: Canadian Heritage for the Special Measures for Journalism component of the Canada
fr_fr: accordée à Patrimoine canadien pour le volet Mesures spéciales pour appuyer le journalisme du Fonds du Canada pour les périodiques afin d'aider les petits organes de presse

source: Periodical Fund to help small and community news outlets continue producing
fr_fr: et les médias communautaires à maintenir la production de contenu éditorial et journalistique

source: quality Canadian editorial and journalistic content; and
fr_fr: canadien de qualité.

source: $6 million over three years, starting in 2026-27 for the
fr_fr: Une somme de 6 millions de dollars sur trois ans, à compter de 2026-2027, sera

source: Canada Council for the Arts to support professional artists and arts organisations.
fr_fr: accordée au Conseil des arts du Canada pour offrir du soutien aux artistes professionnels et aux

source: Protecting Artists' and Creators' Copyrights
fr_fr: Protéger les droits d'auteur dans le secteur des arts et de la création

source: Artists, particularly visual artists, are great contributors to Canada's cultural scene and among the
fr_fr: canadienne, mais comptent malgré tout parmi les personnes ayant le plus faible revenu au Canada. Un

source: lowest income earners in Canada despite their significant cultural contributions. An Artist's Resale
fr_fr: droit de suite de l'artiste permet aux personnes ayant créé une œuvre d'art visuel originale de

source: Right provides the creators of original visual artwork with a royalty whenever their work is resold
fr_fr: percevoir une redevance lorsque leur œuvre est revendue par la suite dans le cadre d'une vente

source: through an eligible sale, providing an additional income stream.
fr_fr: admissible, ce qui leur procure une nouvelle source de revenus.

source: In Budget 2025, the government announces its intent to amend the Copyright Act to create an Artist's Resale Right in Canada, ensuring Canadian
fr_fr: Dans le budget de 2025, le gouvernement annonce son intention de modifier la Loi sur le droit d'auteur pour instituer un droit de suite de l'artiste au Canada, afin que les

source: visual artists benefit from future sales of their work.
fr_fr: membres de la communauté canadienne des arts visuels profitent de futures ventes de leurs œuvres.

source: Protecting Our National Broadcaster: CBC/Radio-Canada
fr_fr: Protéger notre radiodiffuseur national : CBC/Radio-Canada

source: CBC/Radio-Canada is part of our Canadian identity.
fr_fr: CBC/Radio-Canada fait partie de notre identité canadienne.

source: Canada's new government is protecting our national
fr_fr: Le nouveau gouvernement du Canada protège

source: broadcaster by ensuring it has the resources needed to modernise and better deliver for Canadians,
fr_fr: moderniser, améliorer ses services à la population canadienne et continuer à fournir une

source: and to continue providing vital programming in both French and English.
fr_fr: programmation d'information publique en français et en anglais.

source: Budget 2025 proposes to provide $150 million in 2025-26
fr_fr: Le budget de 2025 propose de fournir à CBC/Radio-Canada la somme de 150 millions

source: for CBC/Radio-Canada to strengthen its mandate to serve the public and to better reflect the
fr_fr: de dollars en 2025-2026 pour renforcer son mandat de servir le public et de mieux répondre

source: needs of Canadians.
fr_fr: aux besoins de la population canadienne.

source: The government will explore modernising CBC/Radio-Canada's mandate to
fr_fr: Le gouvernement étudiera la possibilité de moderniser

source: strengthen independence, and is working with CBC/Radio Canada to explore participation in
fr_fr: en collaboration avec CBC/Radio-Canada, la possibilité que le Canada participe à l'Eurovision.

source: Eurovision. Renewing the Canada Strong Pass
fr_fr: Renouveler le laissez-passer Un Canada fort

source: This summer, the government introduced the Canada Strong Pass , which helped
fr_fr: Cet été, le gouvernement a lancé le laissez-passer Un Canada fort , qui a permis aux

source: Canadians see more of our great country, for less money.
fr_fr: Canadiens de visiter notre grand pays à moindre coût.

source: The pass provided families and young people
fr_fr: En utilisant le laissez-passer, les familles

source: free or discounted access to national parks, museums, galleries, and rail travel.
fr_fr: et les jeunes pouvaient accéder gratuitement ou à prix réduit aux parcs nationaux, aux musées, aux

source: It brought
fr_fr: galeries d'art et aux déplacements en train.

source: Canadians together, supported tourism, and celebrated the values that unite us.
fr_fr: stimuler le tourisme et de mettre en lumière les valeurs qui nous unissent.

source: The pass boosted VIA Rail ridership by 6.5 per cent, visits to Parks Canada places
fr_fr: Grâce au laissez-passer, l'achalandage de VIA Rail a grimpé de 6,5 %, le nombre de visites

source: increased by 10 per cent, and visitors at our museums were up around 15 per cent
fr_fr: dans les sites de Parcs Canada a augmenté de 10 %, et il y a eu en moyenne 15 % plus

source: on average.
fr_fr: de visiteurs dans nos musées.
